In [1]:
import pandas as pd
import matplotlib as plt
import sqlite3
import os
import seaborn as sns

In [2]:
#retriing table names from data frame
im_path = r"C:\Users\HP\Desktop\moringa\PHASE1_PROJECT\im.db\im.db"

conn = sqlite3.connect(im_path)
cursor = conn.cursor()

table_name_query = """ SELECT name
                       AS 'Table Names' 
                       FROM sqlite_master 
                       WHERE type='table';
                       """

table_names = pd.read_sql(table_name_query, conn)

print(table_names)

     Table Names
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [3]:
q = """SELECT *
       FROM directors;
    """
df = pd.read_sql(q, conn)

print(df.head())

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [3]:
# marging the movie mudgets in csv file and  cleaning them up
budget_one = pd.read_csv("C:\\Users\\HP\\Desktop\\moringa\\PHASE1_PROJECT\\tn.movie_budgets.csv\\tn.movie_budgets.csv")
budget_two = pd.read_csv("C:\\Users\\HP\\Desktop\\moringa\\PHASE1_PROJECT\\bom.movie_gross.csv\\bom.movie_gross.csv")

In [4]:
budget_one.head()
budget_one.tail()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [6]:
print(budget_one.columns)

Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

In [5]:
budget_one

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [6]:
print(budget_two.columns)

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [7]:
budget_two.drop(columns=["studio", "year"], inplace=True)
budget_two

,title,domestic_gross,foreign_gross
0,Toy Story 3,415000000.0,652000000
1,Alice in Wonderland (2010),334200000.0,691300000
2,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300000
3,Inception,292600000.0,535700000
4,Shrek Forever After,238700000.0,513900000
...,...,...,...
3382,The Quake,6200.0,NaN
3383,Edward II (2018 re-release),4800.0,NaN
3384,El Pacto,2500.0,NaN
3385,The Swan,2400.0,NaN
3386,An Actor Prepares,1700.0,NaN

In [8]:
budget_two.columns = ['movie', 'domestic_gross', 'worldwide_gross']

# Print the updated DataFrame
print(budget_two)

                                            movie  domestic_gross  \
0                                     Toy Story 3     415000000.0
1                      Alice in Wonderland (2010)     334200000.0
2     Harry Potter and the Deathly Hallows Part 1     296000000.0
3                                       Inception     292600000.0
4                             Shrek Forever After     238700000.0
...                                           ...             ...
3382                                    The Quake          6200.0
3383                  Edward II (2018 re-release)          4800.0
3384                                     El Pacto          2500.0
3385                                     The Swan          2400.0
3386                            An Actor Prepares          1700.0

     worldwide_gross
0          652000000
1          691300000
2          664300000
3          535700000
4          513900000
...              ...
3382             NaN
3383             NaN
3384             NaN
3385             NaN
3386             NaN

[3387 rows x 3 columns]

In [9]:
merged_revenue=pd.concat([budget_one, budget_two])
merged_revenue

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1.0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2.0,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3.0,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4.0,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5.0,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
3382,NaN,NaN,The Quake,NaN,6200.0,NaN
3383,NaN,NaN,Edward II (2018 re-release),NaN,4800.0,NaN
3384,NaN,NaN,El Pacto,NaN,2500.0,NaN
3385,NaN,NaN,The Swan,NaN,2400.0,NaN
3386,NaN,NaN,An Actor Prepares,NaN,1700.0,NaN

In [10]:
merged_revenue.drop_duplicates()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1.0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2.0,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3.0,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4.0,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5.0,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
3382,NaN,NaN,The Quake,NaN,6200.0,NaN
3383,NaN,NaN,Edward II (2018 re-release),NaN,4800.0,NaN
3384,NaN,NaN,El Pacto,NaN,2500.0,NaN
3385,NaN,NaN,The Swan,NaN,2400.0,NaN
3386,NaN,NaN,An Actor Prepares,NaN,1700.0,NaN

In [12]:
merged_revenue['domestic_gross'] = pd.to_numeric(merged_revenue['domestic_gross'], errors='coerce')

In [13]:
merged_revenue['domestic_gross'].mean()

28745845.06698422

In [15]:
median_value=merged_revenue['domestic_gross'].median()
median_value

1400000.0

In [16]:
merged_revenue['domestic_gross'].max()

936700000.0

In [17]:
merged_revenue['domestic_gross'].describe()

count    3.359000e+03
mean     2.874585e+07
std      6.698250e+07
min      1.000000e+02
25%      1.200000e+05
50%      1.400000e+06
75%      2.790000e+07
max      9.367000e+08
Name: domestic_gross, dtype: float64

In [18]:
merged_revenue['domestic_gross'] = merged_revenue['domestic_gross'].fillna(median_value)

In [19]:
merged_revenue['worldwide_gross'].describe()

count     7819
unique    6560
top         $0
freq       367
Name: worldwide_gross, dtype: object

In [20]:
# im trying to remove the /$ signs 
merged_revenue['worldwide_gross'] = pd.to_numeric(merged_revenue['worldwide_gross'].replace('[\$,]', '', regex=True), errors='coerce')

In [21]:
median=merged_revenue['worldwide_gross'].median()

In [22]:
merged_revenue['worldwide_gross'] = merged_revenue['worldwide_gross'].fillna(median)

In [23]:
merged_revenue['worldwide_gross'].describe()

count    9.169000e+03
mean     7.804658e+07
std      1.548185e+08
min      0.000000e+00
25%      6.100000e+06
50%      2.526868e+07
75%      7.278517e+07
max      2.776345e+09
Name: worldwide_gross, dtype: float64

In [24]:
m1 = pd.read_csv("C:\\Users\\HP\\Desktop\\moringa\\PHASE1_PROJECT\\tn.movie_budgets.csv\\tn.movie_budgets.csv")
m1

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [25]:

production_budget = m1['production_budget']

production_budget = pd.to_numeric(production_budget.replace('[\$,]', '', regex=True), errors='coerce')
production_budget

0       425000000
1       410600000
2       350000000
3       330600000
4       317000000
          ...
5777         7000
5778         6000
5779         5000
5780         1400
5781         1100
Name: production_budget, Length: 5782, dtype: int64

In [26]:
production_budget.describe()

count    5.782000e+03
mean     3.158776e+07
std      4.181208e+07
min      1.100000e+03
25%      5.000000e+06
50%      1.700000e+07
75%      4.000000e+07
max      4.250000e+08
Name: production_budget, dtype: float64

In [27]:
merged_revenue
pd.set_option('display.float_format', '{:.2f}'.format)
merged_revenue

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1.00,"Dec 18, 2009",Avatar,"$425,000,000",1400000.00,2776345279.00
1,2.00,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000",1400000.00,1045663875.00
2,3.00,"Jun 7, 2019",Dark Phoenix,"$350,000,000",1400000.00,149762350.00
3,4.00,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000",1400000.00,1403013963.00
4,5.00,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000",1400000.00,1316721747.00
...,...,...,...,...,...,...
3382,NaN,NaN,The Quake,NaN,6200.00,25268680.00
3383,NaN,NaN,Edward II (2018 re-release),NaN,4800.00,25268680.00
3384,NaN,NaN,El Pacto,NaN,2500.00,25268680.00
3385,NaN,NaN,The Swan,NaN,2400.00,25268680.00
3386,NaN,NaN,An Actor Prepares,NaN,1700.00,25268680.00

In [108]:
merged_revenue['production_budget'] = production_budget
merged_revenue

,movie,domestic_gross,worldwide_gross,production_budget
0,Avatar,1400000.00,2776345279.00,425000000
1,Pirates of the Caribbean: On Stranger Tides,1400000.00,1045663875.00,410600000
2,Dark Phoenix,1400000.00,149762350.00,350000000
3,Avengers: Age of Ultron,1400000.00,1403013963.00,330600000
4,Star Wars Ep. VIII: The Last Jedi,1400000.00,1316721747.00,317000000
...,...,...,...,...
3382,The Quake,6200.00,25268680.00,12000000
3383,Edward II (2018 re-release),4800.00,25268680.00,12000000
3384,El Pacto,2500.00,25268680.00,12000000
3385,The Swan,2400.00,25268680.00,12000000
3386,An Actor Prepares,1700.00,25268680.00,12000000

In [28]:
merged_revenue['production_budget'].describe()

count            5782
unique            509
top       $20,000,000
freq              231
Name: production_budget, dtype: object

In [33]:
merged_revenue['production_budget'] = pd.to_numeric(merged_revenue['production_budget'].replace('[\$,]', '', regex=True), errors='coerce')

In [34]:
median_production=merged_revenue['production_budget'].median()

In [35]:
merged_revenue['production_budget'] = merged_revenue['production_budget'].fillna(median_production)

In [36]:
merged_revenue['Total_revenue'] = merged_revenue['domestic_gross'] + merged_revenue['worldwide_gross']
merged_revenue['Total_revenue']

0      2777745279.00
1      1047063875.00
2       151162350.00
3      1404413963.00
4      1318121747.00
            ...
3382     25274880.00
3383     25273480.00
3384     25271180.00
3385     25271080.00
3386     25270380.00
Name: Total_revenue, Length: 9169, dtype: float64

In [37]:
merged_revenue['ROI'] = ((merged_revenue['Total_revenue'] - merged_revenue['production_budget']) / merged_revenue['production_budget']) * 100
merged_revenue['ROI']

0      553.59
1      155.01
2      -56.81
3      324.81
4      315.81
        ...
3382    48.68
3383    48.67
3384    48.65
3385    48.65
3386    48.65
Name: ROI, Length: 9169, dtype: float64

In [38]:
merged_revenue['domestic_gross'] = merged_revenue['domestic_gross'].round().astype(int)

merged_revenue['worldwide_gross'] = merged_revenue['worldwide_gross'].round().astype(int)